Revit 2027 API
IPrintSetting.PrintParameters Property
Returns the Parameters of Print Setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
PrintParameters PrintParameters { get; }
ReadOnly Property PrintParameters As PrintParameters
	Get
property PrintParameters^ PrintParameters {
	PrintParameters^ get ();
}
abstract PrintParameters : PrintParameters with get
Property Value
PrintParameters
Remarks
The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.
See Also
Reference
IPrintSetting Interface
Autodesk.Revit.DB Namespace